# Перед использованием удалить все комментарии!

# Используем официальный образ Python в качестве базового (тут указывается вплоть до версии)
FROM python:3

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем содержимое папки app и др. в рабочую директорию контейнера
COPY app/ .
COPY requirements.txt ./

# Устанавливаем перечисленные в файле библиотеки
RUN pip install --no-cache-dir -r requirements.txt

# Создаем точку монтирования для данных
VOLUME /result

# Устанавливаем переменную окружения для Python, чтобы вывод сразу отображался в терминале.
ENV PYTHONUNBUFFERED=1

# Запуск скрипта при старте контейнера
CMD ["python", "city_weather.py"]
